Revit 2026 API

# AreaElemType Enumeration

---

An enumerated type to store type of AreaElement.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AreaElemType
```
```vb
Public Enumeration AreaElemType
```
```cpp
public enum class AreaElemType
```
```fsharp
type AreaElemType
```

| Member name | Value | Description |
| --- | --- | --- |
| BOMAArea | 1 | Office Area Scheme - uses BOMA rules for space classification. |
| GrossArea | 0 | Gross Area Scheme - only 2 types of spaces (internal and external). |

#### Reference

Autodesk.Revit.DB Namespace